# 複数の教員名を区切るカンマは半角と全角の両方が存在するので注意

COURSE2020 = [
# 1Q 情報アーキテクチャコース
%W(2020 1Q #{} #{} #{} #{} 情報アーキテクチャ特論1 小山　裕司 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 1Q #{} #{} #{} #{} 情報セキュリティ特論 奥原　雅之 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 1Q #{} #{} #{} #{} システムソフトウェア特論 柴田　淳司 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 1Q #{} #{} #{} #{} プロジェクト管理特論1 三好　きよみ #{} #{} #{} #{} #{} #{} #{}),
%W(2020 1Q #{} #{} #{} #{} ネットワーク特論 大﨑　理乃 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 1Q #{} #{} #{} #{} データベース特論 木下　修司 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 1Q #{} #{} #{} #{} Javaプログラミング技法 張　晁逢 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 1Q #{} #{} #{} #{} 技術倫理 伏見　靖,川田　誠一 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 1Q #{} #{} #{} #{} フレームワーク開発特論 安川　要平 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 1Q #{} #{} #{} #{} サービスサイエンス特論 松尾　徳朗 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 1Q #{} #{} #{} #{} 情報アーキテクチャ特論3 中鉢　欣秀 #{} #{} #{} #{} #{} #{} #{}),

# 1Q 創造技術コース
%W(2020 1Q #{} #{} #{} #{} プロトタイピング工学特論 近藤　嘉男,内山　純 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 1Q #{} #{} #{} #{} プロダクトデザイン特論 内山　純 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 1Q #{} #{} #{} #{} 設計工学特論 池本　浩幸 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 1Q #{} #{} #{} #{} データサイエンス特論 橋本　洋志,大久保　友幸 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 1Q #{} #{} #{} #{} インテリジェントシステム特論 林　久志 #{} #{} #{} #{} #{} #{} #{}),

# 1Q 事業設計工学コース
%W(2020 1Q #{} #{} #{} #{} 事業設計工学概論 全教員 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 1Q #{} #{} #{} #{} 事業方向性設計特論 廣瀬　雄大 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 1Q #{} #{} #{} #{} エマージング・イノベーション特論 吉田　敏 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 1Q #{} #{} #{} #{} マネジメントシステム基礎特論 板倉　宏昭 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 1Q #{} #{} #{} #{} 会計・ファインナンス工学特論 三好　祐輔 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 1Q #{} #{} #{} #{} サービスサイエンス特論 松尾　徳朗 #{} #{} #{} #{} #{} #{} #{}),

# 2Q 情報アーキテクチャコース
%W(2020 2Q #{} #{} #{} #{} ソフトウェア工学特論 追川　修一 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 2Q #{} #{} #{} #{} 情報セキュリティ特別講義1 奥原　雅之 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 2Q #{} #{} #{} #{} コラボレイティブ開発特論 中鉢　欣秀 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 2Q #{} #{} #{} #{} プロジェクト管理特別講義 三好　きよみ #{} #{} #{} #{} #{} #{} #{}),
%W(2020 2Q #{} #{} #{} #{} システムプログラミング特論 小山　裕司 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 2Q #{} #{} #{} #{} 情報アーキテクチャ特論2 戸沢　義夫 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 2Q #{} #{} #{} #{} 標準化と知財戦略 成田　雅彦 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 2Q #{} #{} #{} #{} ネットワークシステム特別講義 飛田　博章 #{} #{} #{} #{} #{} #{} #{}),

# 2Q 創造技術コース
%W(2020 2Q #{} #{} #{} #{} デザインマネジメント特論 海老澤　伸樹 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 2Q #{} #{} #{} #{} 組込みシステム特論 村越　英樹 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 2Q #{} #{} #{} #{} 人間中心デザイン特論 池本　浩幸 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 2Q #{} #{} #{} #{} 創造設計特論 越水　重臣 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 2Q #{} #{} #{} #{} 価値デザイン特論 國澤　好衛 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 2Q #{} #{} #{} #{} 造形デザイン特別演習 内山　純,和泉　秀明 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 2Q #{} #{} #{} #{} データサイエンス特別演習 宮津　和弘,小畑　崇弘,浅野　浩美 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 2Q #{} #{} #{} #{} グローバルコミュニケーション特論 前田　充浩 #{} #{} #{} #{} #{} #{} #{}),

# 2Q 事業設計工学コース
%W(2020 2Q #{} #{} #{} #{} エマージング・テクノロジー特論 廣瀬　雄大 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 2Q #{} #{} #{} #{} 製品開発組織特論 吉田　敏 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 2Q #{} #{} #{} #{} 意思決定サイエンス特論 細田　貴明 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 2Q #{} #{} #{} #{} 市場創造技術特論 松尾　徳朗 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 2Q #{} #{} #{} #{} リーダーシップ特論 嶋津　恵子 #{} #{} #{} #{} #{} #{} #{}),

# 3Q 情報アーキテクチャコース
%W(2020 3Q #{} #{} #{} #{} OSS特論 小山　裕司 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 3Q #{} #{} #{} #{} データインテリジェンス特論 追川　修一 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 3Q #{} #{} #{} #{} IT・CIO特論 全教員 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 3Q #{} #{} #{} #{} セキュアプログラミング特論 黄　緒平 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 3Q #{} #{} #{} #{} Technical\ Writing\ in\ English 嶋津　恵子 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 3Q #{} #{} #{} #{} クラウドインフラ構築特論 山崎　泰宏 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 3Q #{} #{} #{} #{} クラウドサーバ構築特論 飛田　博章 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 3Q #{} #{} #{} #{} 情報ビジネス特別講義1 六川　浩明 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 3Q #{} #{} #{} #{} プロジェクト管理特論2 酒森　潔 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 3Q #{} #{} #{} #{} 国際開発特論 前田　充浩 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 3Q #{} #{} #{} #{} 情報ビジネス特別講義2 小酒井　正和 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 3Q #{} #{} #{} #{} アジャイル開発手法特論 永瀬　美穂 #{} #{} #{} #{} #{} #{} #{}),

# 3Q 創造技術コース
%W(2020 3Q #{} #{} #{} #{} 機械学習特論 林　久志 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 3Q #{} #{} #{} #{} 工業デザイン材料特論 内山　純 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 3Q #{} #{} #{} #{} コミュニケーションデザイン特論 海老澤　伸樹,河西　大介 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 3Q #{} #{} #{} #{} 信頼性工学特論 越水　重臣 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 3Q #{} #{} #{} #{} システムインテグレーション特論 橋本　洋志 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 3Q #{} #{} #{} #{} ET（Embedded\ Technology）特別演習 村越　英樹 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 3Q #{} #{} #{} #{} プロダクトデザイン特別演習 國澤　好衛，村田　桂太 #{} #{} #{} #{} #{} #{} #{}),

# 3Q 事業設計工学コース
%W(2020 3Q #{} #{} #{} #{} ネットワーク事業設計特論 細田　貴明 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 3Q #{} #{} #{} #{} 事業方向性設計演習 廣瀬　雄大 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 3Q #{} #{} #{} #{} マネジメントシステム応用特論 板倉　宏昭 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 3Q #{} #{} #{} #{} 統計・数理軽量ファインナンス特別演習 三好　祐輔 #{} #{} #{} #{} #{} #{} #{}),

# 4Q 情報アーキテクチャコース
%W(2020 4Q #{} #{} #{} #{} DESIGN\ ［RE］\ THINKING Innella\ Giovanni #{} #{} #{} #{} #{} #{} #{}),
%W(2020 4Q #{} #{} #{} #{} コミュニケーション技術特論 中鉢　欣秀 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 4Q #{} #{} #{} #{} ビッグデータ解析特論 追川　修一 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 4Q #{} #{} #{} #{} 情報セキュリティ特別講義2 奥原　雅之 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 4Q #{} #{} #{} #{} 情報システム特論1 嶋津　恵子 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 4Q #{} #{} #{} #{} プロジェクト管理特論3 三好　きよみ #{} #{} #{} #{} #{} #{} #{}),
%W(2020 4Q #{} #{} #{} #{} 情報技術者倫理 稲垣　実 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 4Q #{} #{} #{} #{} IoT開発特論 飛田　博章 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 4Q #{} #{} #{} #{} 国際経営特論 前田　充浩 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 4Q #{} #{} #{} #{} セキュアシステム管理運用特論 真鍋　敬士 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 4Q #{} #{} #{} #{} 情報ビジネス特別講義3 川名　周 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 4Q #{} #{} #{} #{} 情報システム特論2 戸沢　義夫,亀井　省吾 #{} #{} #{} #{} #{} #{} #{}),

# 4Q 創造技術コース
%W(2020 4Q #{} #{} #{} #{} システムモデリング特論 村越　英樹 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 4Q #{} #{} #{} #{} AIデザイン特論 林　久志 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 4Q #{} #{} #{} #{} 品質工学特論 越水　重臣 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 4Q #{} #{} #{} #{} サービス工学特論 橋本　洋志 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 4Q #{} #{} #{} #{} チーム設計・試作特別演習 池本　浩幸 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 4Q #{} #{} #{} #{} デザイン表現実習 海老澤　伸樹,和泉　秀明 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 4Q #{} #{} #{} #{} デジタルデザイン実習 村田　桂太 #{} #{} #{} #{} #{} #{} #{}),

# 4Q 事業設計工学コース
%W(2020 4Q #{} #{} #{} #{} スタートアップ戦略特論 板倉　宏昭 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 4Q #{} #{} #{} #{} イノベーティブサービス技術特論 細田　貴明 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 4Q #{} #{} #{} #{} 事業継続戦略特論 松尾　徳朗 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 4Q #{} #{} #{} #{} 技術経営戦略特論 吉田　敏 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 4Q #{} #{} #{} #{} 地域経済分析特別演習 三好　祐輔 #{} #{} #{} #{} #{} #{} #{}),
]
