COURSE2020 = [
%W(2020 1Q #{} #{} #{} #{} 情報アーキテクチャ特論1 小山　裕司 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 1Q #{} #{} #{} #{} 情報セキュリティ特論 奥原　雅之 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 1Q #{} #{} #{} #{} システムソフトウェア特論 柴田　淳司 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 1Q #{} #{} #{} #{} プロジェクト管理特論1 三好　きよみ #{} #{} #{} #{} #{} #{} #{}),
%W(2020 1Q #{} #{} #{} #{} ネットワーク特論 大﨑　理乃 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 1Q #{} #{} #{} #{} データベース特論 木下　修司 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 1Q #{} #{} #{} #{} Javaプログラミング技法 張　晁逢 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 1Q #{} #{} #{} #{} 技術倫理 伏見　靖,川田　誠一 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 1Q #{} #{} #{} #{} フレームワーク開発特論 安川　要平 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 1Q #{} #{} #{} #{} サービスサイエンス特論 松尾　徳朗 #{} #{} #{} #{} #{} #{} #{}),
%W(2020 1Q #{} #{} #{} #{} 情報アーキテクチャ特論3 中鉢　欣秀 #{} #{} #{} #{} #{} #{} #{}),
# 
# %W(2020 1Q #{} #{} #{} #{} XXXXXXXXXX XXXXXXXXXX #{} #{} #{} #{} #{} #{} #{}),
# %W(2020 1Q #{} #{} #{} #{} XXXXXXXXXX XXXXXXXXXX #{} #{} #{} #{} #{} #{} #{}),
# %W(2020 1Q #{} #{} #{} #{} XXXXXXXXXX XXXXXXXXXX #{} #{} #{} #{} #{} #{} #{}),
# %W(2020 1Q #{} #{} #{} #{} XXXXXXXXXX XXXXXXXXXX #{} #{} #{} #{} #{} #{} #{}),
# %W(2020 1Q #{} #{} #{} #{} XXXXXXXXXX XXXXXXXXXX #{} #{} #{} #{} #{} #{} #{}),
# %W(2020 1Q #{} #{} #{} #{} XXXXXXXXXX XXXXXXXXXX #{} #{} #{} #{} #{} #{} #{}),
# %W(2020 1Q #{} #{} #{} #{} XXXXXXXXXX XXXXXXXXXX #{} #{} #{} #{} #{} #{} #{}),
# %W(2020 1Q #{} #{} #{} #{} XXXXXXXXXX XXXXXXXXXX #{} #{} #{} #{} #{} #{} #{}),
# %W(2020 1Q #{} #{} #{} #{} XXXXXXXXXX XXXXXXXXXX #{} #{} #{} #{} #{} #{} #{}),
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
]
