# ストラテジスト
STRATEGIST = {
  '2020' => %w(コミュニケーション技術特論 データインテリジェンス特論 ビッグデータ解析特論 情報セキュリティ特論 情報セキュリティ特別講義1 OSS特論 プロジェクト管理特論1 プロジェクト管理特論2 情報ビジネス特別講義1 情報ビジネス特別講義2 IT・CIO特論 情報アーキテクチャ特論2 情報アーキテクチャ特論3 標準化と知財戦略 情報ビジネス特別講義3 情報システム特論2 サービスサイエンス特論),
  '2019' => %w(データインテリジェンス特論 ビッグデータ解析特論 情報インタフェースデザイン特論 IT特論 CIO特論 標準化と知財戦略 情報システム特論2 情報アーキテクチャ特論2 サービスサイエンス特論 情報ビジネス特別講義1 情報ビジネス特別講義4 eビジネス特論 プロジェクト管理特論2 情報ビジネス特別講義2 情報ビジネス特別講義3 インターネットプラットフォーム特論 IoT開発特論),
  '2018' => %w(データインテリジェンス特論 ビッグデータ解析特論 情報インタフェースデザイン特論 IT特論 CIO特論 標準化と知財戦略 情報システム特論2 情報アーキテクチャ特論2 サービスサイエンス特論 情報ビジネス特別講義1 情報ビジネス特別講義4 eビジネス特論 プロジェクト管理特論2 情報ビジネス特別講義2 情報ビジネス特別講義3 インターネットプラットフォーム特論 ユビキタスプラットフォーム特論),
  '2017' => %w(データインテリジェンス特論 ビッグデータ解析特論 情報インタフェースデザイン特論 IT特論 CIO特論 標準化と知財戦略 情報システム特論2 情報アーキテクチャ特論2 サービスサイエンス特論 情報ビジネス特別講義1 情報ビジネス特別講義4 eビジネス特論 プロジェクト管理特論2 情報ビジネス特別講義2 情報ビジネス特別講義3),
}

# システムアーキテクト
SYSTEM_ARCHITECT = {
  '2020' => %w(IoT開発特論 クラウドサーバ構築特論 データインテリジェンス特論 情報セキュリティ特論 フレームワーク開発特論 システムプログラミング特論 ソフトウェア工学特論 OSS特論 コラボレイティブ開発特論 プロジェクト管理特論2 情報システム特論1 IT・CIO特論 情報アーキテクチャ特論2 情報アーキテクチャ特論3 標準化と知財戦略 情報システム特論2 サービスサイエンス特論),
  '2019' => %w(OSS特論 システムプログラミング特論 インターネットプラットフォーム特論 IoT開発特論 情報インタフェースデザイン特論 IT特論 標準化と知財戦略 情報システム特論2 情報アーキテクチャ特論3 サービスサイエンス特論 情報ビジネス特別講義4 eビジネス特論 プロジェクト管理特論2 情報システム特論1 ソフトウェア工学特論 アジャイル開発手法特論 コラボレイティブ開発特論),
  '2018' => %w(OSS特論 システムプログラミング特論 インターネットプラットフォーム特論 ユビキタスプラットフォーム特論 情報インタフェースデザイン特論 IT特論 標準化と知財戦略 情報システム特論2 情報アーキテクチャ特論3 サービスサイエンス特論 情報ビジネス特別講義4 eビジネス特論 プロジェクト管理特論2 情報システム特論1 ソフトウェア工学特論 アジャイル開発手法特論 コラボレイティブ開発特論),
  '2017' => %w(OSS特論 システムプログラミング特論 インターネットプラットフォーム特論 ユビキタスプラットフォーム特論 情報インタフェースデザイン特論 IT特論 標準化と知財戦略 情報システム特論2 情報アーキテクチャ特論3 サービスサイエンス特論 情報ビジネス特別講義4 eビジネス特論 プロジェクト管理特論2 情報システム特論1 ソフトウェア工学特論 アジャイル開発手法特論 コラボレイティブ開発特論),
}

# プロジェクトマネージャ
PROJECT_MANAGER = {
  '2020' => %w(コミュニケーション技術特論 ネットワークシステム特別講義 情報セキュリティ特別講義1 セキュアシステム管理運用特論 ソフトウェア工学特論 アジャイル開発手法特論 プロジェクト管理特論1 プロジェクト管理特論2 プロジェクト管理特論3 プロジェクト管理特別講義 情報ビジネス特別講義1 情報ビジネス特別講義2 情報システム特論1 IT・CIO特論 標準化と知財戦略 情報ビジネス特別講義3 情報システム特論2),
  '2019' => %w(コミュニケーション技術特論2 標準化と知財戦略 情報システム特論2 情報アーキテクチャ特論2 情報ビジネス特別講義1 プロジェクト管理特論1 プロジェクト管理特別講義 プロジェクト管理特論2 プロジェクト管理特論3 情報システム特論1 情報ビジネス特別講義2 情報ビジネス特別講義3 オブジェクト指向開発特論 ソフトウェア工学特論 アジャイル開発手法特論 リーダーシップ特別講義 経営戦略特論),
  '2018' => %w(コミュニケーション技術特論2 標準化と知財戦略 情報システム特論2 情報アーキテクチャ特論2 情報ビジネス特別講義1 プロジェクト管理特論1 プロジェクト管理特別講義 プロジェクト管理特論2 プロジェクト管理特論3 情報システム特論1 情報ビジネス特別講義2 情報ビジネス特別講義3 オブジェクト指向開発特論 ソフトウェア工学特論 アジャイル開発手法特論 リーダーシップ特別講義 経営戦略特論),
  '2017' => %w(コミュニケーション技術特論2 標準化と知財戦略 情報システム特論2 情報アーキテクチャ特論2 情報ビジネス特別講義1 プロジェクト管理特論1 プロジェクト管理特別講義 プロジェクト管理特論2 プロジェクト管理特論3 情報システム特論1 情報ビジネス特別講義2 情報ビジネス特別講義3 オブジェクト指向開発特論 ソフトウェア工学特論 アジャイル開発手法特論),
}

# テクニカルスペシャリスト
TECHNICAL_SPECIALIST = {
  '2020' => %w(ネットワークシステム特別講義 クラウドインフラ構築特論 IoT開発特論 クラウドサーバ構築特論 データベース特論 ビッグデータ解析特論 情報セキュリティ特論 情報セキュリティ特別講義1 情報セキュリティ特別講義2 セキュアプログラミング特論 セキュアシステム管理運用特論 フレームワーク開発特論 システムプログラミング特論 ソフトウェア工学特論 OSS特論 コラボレイティブ開発特論 アジャイル開発手法特論),
  '2019' => %w(システムプログラミング特論 ネットワーク特論2 ネットワークシステム特別講義2 情報セキュリティ特論 データベース特論 ビッグデータ解析特論 クラウドインフラ構築特論 情報セキュリティ特別講義1 情報システム特論1 フレームワーク開発特論 ソフトウェア工学特論 情報セキュリティ特別講義2 セキュアプログラミング特論 コラボレイティブ開発特論 アジャイル開発手法特論 クラウドサーバ構築特論 オブジェクト指向開発特論),
  '2018' => %w(システムプログラミング特論 ネットワーク特論2 ネットワークシステム特別講義2 情報セキュリティ特論 データベース特論 ビッグデータ解析特論 クラウドインフラ構築特論 情報セキュリティ特別講義1 情報システム特論1 フレームワーク開発特論 ソフトウェア工学特論 情報セキュリティ特別講義2 セキュアプログラミング特論 コラボレイティブ開発特論 アジャイル開発手法特論 クラウドサーバ構築特論 オブジェクト指向開発特論),
  '2017' => %w(システムプログラミング特論 ネットワーク特論2 ネットワークシステム特別講義2 情報セキュリティ特論 データベース特論 ビッグデータ解析特論 クラウドインフラ構築特論 情報セキュリティ特別講義1 情報システム特論1 フレームワーク開発特論 ソフトウェア工学特論 情報セキュリティ特別講義2 セキュアプログラミング特論 コラボレイティブ開発特論 アジャイル開発手法特論),
}
